In [10]:
# LIMIT
#? WORKS IN MYSQL AND BIGQUERY

import mysql.connector as sql
import pandas as pd

mydb = sql.connect (
    host = "localhost",
    user = "root",
    password = "ZAQs8271911c$",
    auth_plugin='mysql_native_password',
    buffered = True,          # using this for reading table, panda dont need it
    #multi=True,                 # if wanna use mulitple query
    database = "sql_intro"
)

# auth_plugin is needed, can check by commends 
# SELECT user,authentication_string,plugin,host FROM mysql.user;
# check the columns plugin and user


#? only execute sql query wo passing data to panda dataframe
# mycoursor = mydb.cursor()
# mycoursor.execute(
#     """
#     #! create database
#     create database if not exists database_name;
#     """
# )


#? execute sql query  AND  passing data to panda dataframe
# edit sql query here
sql_query = """
select * 
from employees
"""
# run sql queries and Importing data from a MySQL database 
# into Pandas data frame

df = pd.read_sql_query(
    sql_query,
    mydb)


# mydb.close() for closing connection

# limit
### just like pandas head()

In [13]:
sql_query = """
SELECT *
FROM emp_details
LIMIT 5;
"""
#! limit 5 means only show 5 records from the top

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     Name  Age sex         doj      city   salary
0   Jimmy   35   M  2005-05-30   Chicago  70000.0
1   Shane   30   M  1999-06-25   Seattle  55000.0
2   Marry   28   F  2009-03-10    Boston  62000.0
3  Dwayne   37   M  2011-07-12    Austin  57000.0
4    Sara   32   F  2017-10-27  New York  72000.0